/* 
  Localizable.strings
  AventailConnect

  Created by Praveen Kumar on 7/6/11.
  Copyright 2011 SonicWall, Inc. All rights reserved.
*/

"IDS_AUTHENTICATION_DIALOG_MESSAGE" = "Log in to establish a secure connection to your network resources.";
"IDS_AUTHENTICATION_DIALOG_TITLE" = "Enter Credentials";
"IDS_AUTHENTICATION_MESSAGE_BADCREDENTIALS" = "Your credentials have been rejected, please try again.";
"IDS_AUTHENTICATION_MESSAGE_PASSWORD_CHANGE_CONFIRM" = "Password changed successfully.";
"IDS_AUTHENTICATION_MESSAGE_PASSWORD_CHANGE_ERROR" = "Password change failed, Your credentials have been rejected.";
"IDS_AUTHENTICATION_MESSAGE_PASSWORD_CHANGE_IN_HISTORY" = "Password change history";
"IDS_AUTHENTICATION_MESSAGE_PASSWORD_CHANGE_INVALID_SYNTAX" = "Password change failed, invalid syntax.";
"IDS_AUTHENTICATION_MESSAGE_PASSWORD_CHANGE_LDAP_ERROR" = "Password change failed due to LDAP error.";
"IDS_AUTHENTICATION_MESSAGE_PASSWORD_CHANGE_NOT_ALLOWED" = "Password change is not allowed for this account.";
"IDS_AUTHENTICATION_MESSAGE_PASSWORD_CHANGE_POSTFIX" = "Please change your password.";
"IDS_AUTHENTICATION_MESSAGE_PASSWORD_CHANGE_SUPPLY_OLD_PASSWORD" = "Please enter your current password.";
"IDS_AUTHENTICATION_MESSAGE_PASSWORD_CHANGE_TOO_SHORT" = "The new password you have chosen is too short, Please choose another password.";
"IDS_AUTHENTICATION_MESSAGE_PASSWORD_CHANGE_TOO_YOUNG" = "Your previous password is too young to change.";
"IDS_AUTHENTICATION_MESSAGE_PASSWORD_CHANGE_UNKNOWN_ERROR" = "Password change failed due to unknown reason.";
"IDS_AUTHENTICATION_MESSAGE_PASSWORD_EXPIRED" = "Your password has expired.";
"IDS_AUTHENTICATION_MESSAGE_PASSWORD_EXPIRY_WARNING_DAYS" = "Your password will expire in %@ days.";
"IDS_AUTHENTICATION_MESSAGE_PASSWORD_EXPIRY_WARNING_HOURS_MINS" = "Your password will expire in %@ hours and %@ minutes.";
"IDS_AUTHENTICATION_MESSAGE_PASSWORD_EXPIRY_WARNING_MINS_SEC" = "Your password will expire in %@ minutes and %@ seconds.";
"IDS_AUTHENTICATION_MESSAGE_PASSWORD_NEW_PASSWORD_MISMATCHED" = "Your new password fields do not match.";
"IDS_AUTHENTICATION_MESSAGE_PASSWORD_WARNING_ACCOUNT_LOCKED" = "Unable to log you on because your account has been locked.";
"IDS_AUTHENTICATION_MESSAGE_PASSWORD_WARNING_CHANGE_AFTER_RESET" = "Your password has been reset, please change your password.";
"IDS_AUTHENTICATION_MESSAGE_PASSWORD_WARNING_GRACE_LOGINS" = "Your password has expired, You can grace logins %@ times.";
"IDS_AUTHENTICATION_PROMPT_ENTER_PASSWORD" = "Password:";
"IDS_AUTHENTICATION_PROMPT_NEW_PASSWORD" = "New Password:";
"IDS_AUTHENTICATION_PROMPT_OLD_PASSWORD" = "Current Password:";
"IDS_AUTHENTICATION_PROMPT_PASSWORD" = "Password:";
"IDS_AUTHENTICATION_PROMPT_USERNAME" = "Username:";
"IDS_AUTHENTICATION_PROMPT_VERIFY_PASSWORD" = "Retype New Password:";
"IDS_AUTHENTICATION_TITLE_PASSWORD_NOTIFICATION" = "Change Credentials";
"IDS_AUTHENTICATION_MESSAGE_ENTER_OTP" = "Your one time password has been sent to %@. Please type it here.";
"IDS_AUTHENTICATION_MESSAGE_ENTER_OTP_NO_MAIL" = "Your One Time Password has been sent to your email address. Please type it here.";
"IDS_AUTHENTICATION_TITLE_OTP_NOTIFICATION" = "One Time Password Required";
"IDS_AUTHENTICATION_PROMPT_OTP" = "One Time Password:";
"IDS_AUTHENTICATION_TITLE_SESSION_LIMIT_NOTIFICATION" = "Session Limit Warning!";
"IDS_AUTHENTICATION_MESSAGE_TERMINATE_SESSIONS_DIALOG" = "You have reached the maximum session limit. Log in to terminate your existing sessions and start a new one.";
"IDS_AUTHENTICATION_PROMPT_ENTER_PASSCODE" = "Passcode:";
"IDS_AUTHENTICATION_PROMPT_NEXT_CODE" = "Please enter new passcode after it changes on your token";
"IDS_AUTHENTICATION_MESSAGE_NEW_PIN" = "New PIN required!";
"IDS_AUTHENTICATION_MESSAGE_NEW_PIN_DISPLAY" = "Your new PIN is %@";
"IDS_AUTHENTICATION_MESSAGE_NEXT_PASSCODE" = "New passcode needed. Please enter new passcode after it changes on your token.";
"IDS_AUTHENTICATION_MESSAGE_NEXT_TOKENCODE" = "Please enter new tokencode after it changes on your token";
"IDS_AUTHENTICATION_MESSAGE_NEW_PIN_CHOICE" = "Please enter a new PIN.";
"IDS_AUTHENTICATION_MESSAGE_NEW_PIN_SYSTEM" = "System will generate a new PIN for you.";
"IDS_AUTHENTICATION_MESSAGE_NEW_PIN_USER_ALPHA" = "Please enter your new PIN. Minimum Length: %@ Maximum Length: %@.";
"IDS_AUTHENTICATION_MESSAGE_NEW_PIN_USER_NUMERIC" = "Your PIN can have only numbers. Minimum Length: %@ Maximum Length: %@.";
"IDS_AUTHENTICATION_MESSAGE_PASSCODE_ACCEPTED" = "Passcode Accepted";
"IDS_AUTHENTICATION_MESSAGE_PIN_REJECTED" = "PIN rejected";
"IDS_AUTHENTICATION_PROMPT_NEW_PIN" = "New PIN:";
"IDS_AUTHENTICATION_MESSAGE_ACCESS_DENIED" = "Access Denied";
"IDS_AUTHENTICATION_PROMPT_DOMAIN" = "Domain:";
"IDS_AUTHENTICATION_MESSAGE_MUST_SELECT" = "Select Required";
"IDS_AUTHENTICATION_ENUM_MESSAGE_PASSWORD_CHANGE_POSTFIX" = "Do you want to change it now? Press OK to change, or press Continue to skip.";
"IDS_AUTHENTICATION_MESSAGE_MULTIPLE_MAIL_ENTER_OTP" = "Your One Time Password has been sent to %@ and %@. Please type it here.";
"IDS_PROXY_AUTH_DIALOG_TITLE" = "Authentication Required";
"IDS_PROXY_AUTH_MESSAGE" = "Please enter credentials for proxy - %@";
"IDS_PROXY_AUTH_PROMPT_USERNAME" = "Username";
"IDS_PROXY_AUTH_PROMPT_PASSWORD" = "Password";
"ERROR_AUTH_NOT_SUPPORTED" = "Authentication type not supported.";
"IDS_AUTHENTICATION_TITLE_OTP_REGISTER" = "Register for One Time Password";
"IDS_AUTHENTICATION_MESSAGE_OTP_REGISTER" = "Secret key: %@";
"IDS_AUTHENTICATION_PROMPT_OTP_REGISTER" = "Enter the 6 digit code generated by the One Time Password app:";
"IDS_AUTHENTICATION_MESSAGE_OTP_REGISTER_ERR" = "Invalid code, check your device time.";
"IDS_AUTHENTICATION_MESSAGE_TOTP_BCKP_PROMPT" = "To continue with your login, enter the 6 digit code generated by the One Time Password app or the backup code.";
"IDS_AUTHENTICATION_MESSAGE_TOTP_PROMPT" = "To continue with your login, enter the 6 digit code generated by the One Time Password app.";
"IDS_AUTHENTICATION_PROMPT_TOTP_BCKP" = "Enter 6 digit code or backup code:";
"IDS_AUTHENTICATION_PROMPT_TOTP" = "Enter the code:";
"IDS_AUTHENTICATION_MESSAGE_OTP_ACCOUNT_LOCKED" = "Access Denied. Your account has been locked due to too many invalid codes. Contact your administrator for next steps.";
"IDS_AUTHENTICATION_TITLE_TOTP_LOCKED" = "One Time Password Error";
"IDS_AUTHENTICATION_TITLE_OTP_REG_SUCC" = "App Based One Time Password Registration Successful";
"IDS_AUTHENTICATION_MESSAGE_OTP_REG_SUCC" = "You have successfully registered for the One Time Password app based login. In future, use the codes generated on the One Time Password app to login into your account.";
"IDS_AUTHENTICATION_MESSAGE_BACKUP_CODES_INFO" = "If you are unable to generate codes from the One Time Password app, you can use backup codes provided below. These backup codes are non-expiring, one time use codes and can also be found in \'Details\' area when you login into your remote access portal. Store these backup codes safely and use them as needed.";
"IDS_AUTHENTICATION_MESSAGE_BACKUP_CODES_LIST" = "Backup codes: %@";
"IDS_AUTHENTICATION_MESSAGE_OTP_ERR" = "Invalid code.";
"IDS_AUTHENTICATION_MESSAGE_OTP_ERR_ATTEMPTS" = "Invalid code, you are left with %@ attempt(s).";
"IDS_AUTHENTICATION_MESSAGE_MULTIPLE_MAIL_PHONE_ENTER_OTP" = "Your One Time Password has been sent to %s, %s and %s. Please type it here.";
"IDS_AUTHENTICATION_MESSAGE_SEND_OTP_FAIL" = "Unable to send One Time Password. Contact your administrator.";

///////////////////////////////////////////////
// Server certificate Error codes and reasons//
///////////////////////////////////////////////
"SSL.Error.Code.2" =  "Unable to get issuer certificate";
"SSL.Error.Code.3" = "Unable to get certificate CRL";
"SSL.Error.Code.4" = "Unable to decrypt certificate's signature";
"SSL.Error.Code.5" = "Unable to decrypt CRL's signature";
"SSL.Error.Code.6" = "Unable to decode issuer public key";
"SSL.Error.Code.7" = "Signature failure";
"SSL.Error.Code.8" = "CRL signature failure";
"SSL.Error.Code.9" = "Not yet valid";
"SSL.Error.Code.10" = "Expired";
"SSL.Error.Code.11" = "CRL is not yet valid";
"SSL.Error.Code.12" = "CRL has expired";
"SSL.Error.Code.13" = "Format error in notBefore field";
"SSL.Error.Code.14" = "Format error in notAfter field";
"SSL.Error.Code.15" = "Format error in CRL's lastUpdate field";
"SSL.Error.Code.16" = "Format error in CRL's nextUpdate field";
"SSL.Error.Code.17" = "Out of memory";
"SSL.Error.Code.18" = "Self signed certificate";
"SSL.Error.Code.19" = "Self signed certificate in certificate chain";
"SSL.Error.Code.20" = "Unable to get local issuer certificate";
"SSL.Error.Code.21" = "Unable to verify the first certificate";
"SSL.Error.Code.22" = "Certificate chain too long";
"SSL.Error.Code.23" = "Revoked";
"SSL.Error.Code.24" = "Invalid CA certificate";
"SSL.Error.Code.25" = "Path length constraint exceeded";
"SSL.Error.Code.26" = "Unsupported certificate purpose";
"SSL.Error.Code.27" = "Not trusted";
"SSL.Error.Code.28" = "Rejected";
"SSL.Error.Code.29" = "Subject issuer mismatch";
"SSL.Error.Code.30" = "Authority and subject key identifier mismatch";
"SSL.Error.Code.31" = "Authority and issuer serial number mismatch";
"SSL.Error.Code.32" = "Key usage does not include certificate signing";
"SSL.Error.Code.33" = "Unable to get CRL issuer certificate";
"SSL.Error.Code.34" = "Unhandled critical extension";
"SSL.Error.Code.35" = "Key usage does not include CRL signing";
"SSL.Error.Code.36" = "Unhandled critical CRL extension";
"SSL.Error.Code.37" = "Invalid non-CA certificate (has CA markings)";
"SSL.Error.Code.38" = "Proxy path length constraint exceeded";
"SSL.Error.Code.39" = "Key usage does not include digital signature";
"SSL.Error.Code.40" = "Proxy certificates not allowed, please set the appropriate flag";
"SSL.Error.Code.41" = "Invalid or inconsistent certificate extension";
"SSL.Error.Code.42" = "Invalid or inconsistent certificate policy extension";
"SSL.Error.Code.43" = "No explicit policy";
"SSL.Error.Code.44" = "RFC 3779 resource not subset of parent's resources";
"SSL.Error.Code.50" = "Host Name verification failure";
"SSL.Error.Code.51" = "The name of the certificate is invalid or does not match the name of the VPN";


///////////////////////////////////////////////
// EVPN error messages                       //
///////////////////////////////////////////////
"EVPN.Error.SessionExpired"				= "Session Expired.";
"EVPN.Error.Protocol"					= "Mobile Connect is unable to negotiate with the VPN server.";
"EVPN.Error.Timeout"					= "VPN Connection timed out.";
"EVPN.Error.ClientVip"					= "VPN server could not allocate an IP address.";
"EVPN.Error.Authorization"				= "VPN server could not authorize.";
"EVPN.Error.System"						= "General System Error. Please contact your administrator.";
"EVPN.Error.ClientVersionMismatch"		= "VPN connections cannot be established with this version of the client.";
"EVPN.Error.AddressConflict"			= "Your local network configuration is causing the VPN Connection to fail. Please contact your system administrator";
"EVPN.Error.Resume"						= "VPN Connection cannot be established.";


///////////////////////////////////////////////
// IPC error messages                        //
///////////////////////////////////////////////
"IPC.Error.General"						= "General System Error. Please contact your administrator";
"IPC.Error.VersionMismatch"				= "Error. Cannot extablish VPN because the application version is out of date. Plese update.";
"IPC.Error.InvalidMsg"					= "Invalid IPC.";
"IPC.Error.InvalidParam"				= "Parameter missing from IPC.";
"IPC.Error.InvalidState"				= "Invalid IPC state.";

// SSL Certificate prompt UI strings
"SSL.Certificate.Prompt.MainLabel"		= "Mobile Connect cannot verify the identity of the server \"%@\"";
"SSL.Certificate.Prompt.Description"	= "The certificate for this server is invalid. You might be connecting to a server that is pretending to be \"%@\", which could put your confidential information at risk. Would you like to connect to the server anyway?";
"SSL.Certificate.Prompt.CheckboxLabel"	= "Always trust \"%@\" when connecting to \"%@\"";

// UI Labels
"UI.Device.Authorize.Page.Label"        = "Authorize your device";
"UI.Device.Authorize.Terms.Label"       = "Device Authorization - Terms";
"UI.App.Control.List.Title"             = "Authorized Apps";

// Notifications
"UI.Notification.ResourceAccessDenied"      = "You do not have permission to access %@. Please contact your network administrator.";

"UI.Notification.AppAccessDenied"           = "%@ is not allowed to access the corporate network from this device. Please use applications that are permitted by your administrator or contact your administrator for assitance.";

"UI.Notification.AppResourceAccessDenied"   = "%@ is not allowed to access %@ on port %d. Please use applications that are permitted or contact your administrator to add %@ to your permitted applications.";

"UI.Notification.AppVersionAccessDenied"    = "The %@ version you are using is not allowed access to the corporate network. Please update to %@ %@ or ask your network administrator to allow the version you are using.";


"UI.Name"            = "Name";
"UI.Server"          = "Server";
"UI.Domain"          = "Domain";
"UI.Certificate"     = "Certificate";
"UI.Username"        = "Username";
"UI.Password"        = "Password";
"UI.Cancel"          = "Cancel";
"UI.Back"            = "Back";
"UI.Next"            = "Next";
"UI.Save"            = "Save";
"UI.OK"              = "OK";
"UI.Saving"          = "Saving...";
"UI.Details"         = "Details";
"UI.Continue"        = "Continue";
"UI.Delete"          = "Delete";
"UI.Login"           = "Login";
"UI.Error"           = "Error";
"UI.Warning"         = "Warning";
"UI.Yes"             = "Yes";
"UI.No"              = "No";
"UI.Reconnect"       = "Reconnect";
"UI.TryAnyway"       = "Try Anyway";
"UI.Enable"          = "Enable";
"UI.Enabled"         = "Enabled";
"UI.ON"              = "ON";
"UI.OFF"             = "OFF";
"UI.Connect"         = "Connect";
"UI.Disconnect"      = "Disconnect";
"UI.Accept"          = "Accept";
"UI.Decline"         = "Decline";
"UI.Protocol"        = "Protocol";

"UI.OldPassword"         = "Old Password";
"UI.NewPassword"         = "New Password";
"UI.NewPasswordAgain"    = "New (again)";

"UI.All"                  = "All";
"UI.Null"                 = "Null";
"UI.Close"                = "close";
"UI.Bytes"                = "bytes";
"UI.Ms"                   = "ms";
"UI.AlwaysConnect"        = "Always Connect";
"UI.ApplicationControl"   = "Application Control";
"UI.Authenticating"       = "Authenticating...";
"UI.ApplicationControl.Learning"   = "Application Control Learning";

"UI.Biometric.TouchID"     = "Touch ID";
"UI.Biometric.FaceID"      = "Face ID";
"UI.Biometric.Default"     = "Touch/Face ID";

"UI.ConnectionMode.RANL"   = "Redirect all - Non local";
"UI.ConnectionMode.RA"     = "Redirect all";
"UI.ConnectionMode.ST"     = "Split tunnel";
"UI.ConnectionMode.STNL"   = "Split tunnel - Non local";

"UI.NewPIN.label"          = "New PIN";
"UI.ConfirmPIN.label"      = "Confirm PIN";
"UI.Authentication.label"  = "Authentication";
"UI.AddADomain.label"      = "Add a domain";

"UI.Selections"              = "Selections";
"UI.LoginGroup"              = "Login Group";
"UI.RememberCredentials"     = "Remember Credentials";
"UI.ClientCertificate"       = "Client Certificate";
"UI.ConnectOnDemand"         = "Connect On Demand";
"UI.TrustedNetworks"         = "Trusted Networks";
"UI.NotApplicable"           = "Not Applicable";
"UI.N/A"                     = "N/A";

"UI.DataFormat.Day" = "day";
"UI.DataFormat.Days" = "days";

"UI.Device.Registration"         = "Device Registration";
"UI.Device.Authorize"            = "Authorize your device";

"UI.Device.Registration.NewDevice.Prohibited.title"      = "Device Registration Prohibited";
"UI.Device.Registration.Pending.title"                   = "Device Registration Pending";
"UI.Device.Registration.ThisDevice.Prohibited.title"     = "Your Device Prohibited";

"UI.Placeholder.ValidServerRequired"       = "Valid server required";
"UI.Placeholder.Required"          = "Required";
"UI.Placeholder.Optional"          = "Optional";
"UI.Placeholder.LoadingDomains"    = "Loading domains...";
"UI.Placeholder.Loading"           = "Loading...";
"UI.Placeholder.CheckingPolicies"  = "Checking policies...";
"UI.Placeholder.Downloading"       = "Downloading...";
"UI.Placeholder.remaining"         = "remaining";
"UI.Placeholder.Stalled"           = "Stalled";

"UI.Domain.ChooseDuringLogin"  = "Choose during login";
"UI.Domain.None"              = "(No Domain)";

"UI.Certificate.Select.Tips"              = "Please select a certificate from the list";
"UI.Certificate.ChooseDuringLogin"        = "Choose during login";
"UI.Certificate.ChooseDuringLogin.Tips"   = "You will be prompted to select a certificate if the server requires one.";
"UI.Certificate.None"                     = "None";
"UI.Certificate.None.Tips"                = "If the server requires a certificate, login will be canceled.";
"UI.Certificate.Details"                  = "Certificate Details";
"UI.Certificate.Accept"                   = "Accept";
"UI.Certificate.Accept.Tips"              = "Would you like to always trust this certificate?";
"UI.Certificate.Information"              = "Information";
"UI.Certificate.Validity"                 = "Validity";
"UI.Certificate.Subject"                  = "Subject";
"UI.Certificate.Issuer"                   = "Issuer";
"UI.Certificate.CommonName"               = "Common Name";
"UI.Certificate.Country"                  = "Country";
"UI.Certificate.Organization"             = "Organization";
"UI.Certificate.Serial"                   = "Serial";
"UI.Certificate.Fingerprint"              = "Fingerprint";
"UI.Certificate.NotValidBefore"           = "Not Valid Before";
"UI.Certificate.NotValidAfter"            = "Not Valid After";
"UI.Certificate.Expires"                  = "Expires";
"UI.Certificate.IssuedBy"                 = "Issued by";///check this one now.
"UI.Certificate.IssuedBy.colon"           = "Issued by:";
"UI.Certificate.Expires.colon"            = "Expires:";


"UI.Connection.Login.Title"                                      = "Please log in";
"UI.Connection.Cell.Connection.Label"                            = "Connection";
"UI.Connection.Cell.Connection.Detail.NoneSelected.Label"        = "None Selected";
"UI.Connection.Cell.Connection.Detail.AddConnection.Label"       = "Add Connection";
"UI.Connection.Cell.VPN.Label"                              = "VPN";
"UI.Connection.Cell.Status.Label"                           = "Status";
"UI.Connection.ConnectionList.Connetions.title"             = "Connections";
"UI.Connection.ConnectionList.CreateANewConnection.label"   = "Create a new connection";
"UI.Connection.ConnectionList.AddConnection.title"          = "Add Connection";
"UI.Connection.ConnectionList.Verifying.title"              = "Verifying...";
"UI.Connection.ConnectionList.EditConnection.title"         = "Edit Connection";
"UI.Connection.ConnectionList.Certificate.title"            = "Certificate";
"UI.Connection.ConnectionList.OrChooseAConnection.label"    = "Or choose a connection";
"UI.Connection.ConnectionList.DeleteConnection.label"       = "Delete Connection";
"UI.Connection.ConnectionList.DeleteConnection.Warning"     = "Are you sure?";

"UI.Connection.Section.Showing.Label"         = "Showing: %@";

"UI.Monitor.Title"                            = "Monitor";
"UI.Monitor.Section.ConnectionInfo.Header"    = "Connection Info";
"UI.Monitor.Cell.Status.Label"                = "Status";
"UI.Monitor.Cell.Status.Value.Unknown"        = "Unknown";
"UI.Monitor.Cell.Server.Label"                = "Server";
"UI.Monitor.Cell.ClientIP.Label"              = "Client IP";
"UI.Monitor.Cell.ClientIPv6.Label"            = "Client IPv6";
"UI.Monitor.Cell.Protocol.Label"              = "Protocol";
"UI.Monitor.Cell.Cipher.Label"                = "Cipher";
"UI.Monitor.Section.Statistics.Header"        = "Statistics";
"UI.Monitor.Cell.Sent.Label"                  = "Sent";
"UI.Monitor.Cell.Received.Label"              = "Received";
"UI.Monitor.Cell.Throughput.Label"            = "Throughput";
"UI.Monitor.Cell.Throughput.Avg.Label"        = "avg";
"UI.Monitor.Cell.Throughput.Max.Label"        = "max";
"UI.Monitor.Cell.Throughput.value.format"     = "%@/Sec";
"UI.Monitor.Cell.Compression.Label"           = "Compression";
"UI.Monitor.Cell.Speed.format.bytes"          = "%llu bytes";
"UI.Monitor.Cell.Speed.format.KB"             = "%0.2f KB";
"UI.Monitor.Cell.Speed.format.MB"             = "%0.2f MB";
"UI.Monitor.Cell.Speed.format.GB"             = "%0.2f GB";
"UI.Monitor.Cell.Speed.format.Packets"        = "%llu packets";
"UI.Monitor.Cell.CompressionRatio.Label"      = "Compression Ratio";
"UI.Monitor.Section.DNS.Header"               = "DNS";
"UI.Monitor.Section.DNS.Value.None"           = "None";
"UI.Monitor.Cell.Suffix.Label"                = "Suffix";
"UI.Monitor.Section.Routes.Header"            = "Routes";
"UI.Monitor.Section.Routes.value.TunnelAllMode"        = "Tunnel All Mode";

"AV_UI.Monitor.Section.ConnectionInfo.Header"    = "Connection Info";
"AV_UI.Monitor.Section.Statistics.Header"        = "Statistics";
"AV_UI.Monitor.Section.DNS.Servers.Header"        = "DNS Servers";
"AV_UI.Monitor.Section.DNS.Suffixes.Header"       = "DNS Suffixes";
"AV_UI.Monitor.Section.Cipher.Header"             = "Cipher";
"AV_UI.Monitor.Section.ESP.Header"                = "ESP";

"AV_UI.Monitor.Cell.Status.Label"                = "Status";
"AV_UI.Monitor.Cell.Server.Label"                = "Server";
"AV_UI.Monitor.Cell.Login.Group.Label"           = "Login Group";
"AV_UI.Monitor.Cell.Community.Label"             = "Community";
"AV_UI.Monitor.Cell.Zone.Label"                  = "Zone";
"AV_UI.Monitor.Cell.DeviceAuthorization.Label"   = "Device Authorization";
"AV_UI.Monitor.Cell.IPAddress.Label"             = "IP Address";
"AV_UI.Monitor.Cell.TimeConnected.Label"         = "Time Connected";
"AV_UI.Monitor.Cell.PingTime(ms).Label"          = "Ping Time (ms)";
"AV_UI.Monitor.Cell.MTU.Label"                   = "MTU";
"AV_UI.Monitor.Cell.Redirection.Label"           = "Redirection";
"AV_UI.Monitor.Cell.ESP.Label"                   = "ESP";
"AV_UI.Monitor.Cell.CompressionEnabled.Label"    = "Compression Enabled";
"AV_UI.Monitor.Cell.RemoteInternetProxy.Label"   = "Remote Internet Proxy";

"AV_UI.Monitor.Cell.Data.Sent.Label"                       = "Data Sent";
"AV_UI.Monitor.Cell.Data.Received.Label"                   = "Data Received";
"AV_UI.Monitor.Cell.Packets.Sent.Label"                    = "Packets Sent";
"AV_UI.Monitor.Cell.Packets.Received.Label"                = "Packets Received";

"AV_UI.Monitor.Cell.Cipher.Name.Label"                     = "Name";
"AV_UI.Monitor.Cell.Cipher.Protocol.Label"                 = "Protocol";
"AV_UI.Monitor.Cell.Cipher.AuthenticationMethod.Label"     = "Authentication Method";
"AV_UI.Monitor.Cell.Cipher.KeyExchangeAlgorithm.Label"     = "Key Exchange Algorithm";
"AV_UI.Monitor.Cell.Cipher.Encryption.Label"               = "Encryption";
"AV_UI.Monitor.Cell.Cipher.MAC.Label"                      = "MAC";
"AV_UI.Monitor.Cell.Cipher.KeyExchangeBits.Label"          = "Key Exchange Bits";
"AV_UI.Monitor.Cell.Cipher.EllipticCurve.Label"            = "Elliptic Curve";

"AV_UI.Monitor.Cell.ESP.Mode.Label"                  = "Mode";
"AV_UI.Monitor.Cell.ESP.Cipher.Label"                = "Cipher";
"AV_UI.Monitor.Cell.ESP.MAC.Label"                   = "MAC";
"AV_UI.Monitor.Cell.ESP.Mode.None.Label"             = "None";
"AV_UI.Monitor.Cell.ESP.Mode.UDP.Label"              = "UDP";
"AV_UI.Monitor.Cell.ESP.Mode.ALL.Label"              = "ALL";



"UI.Settings.Section.Settings.Header"        = "Settings";
"UI.Settings.Section.WebSecurityPolicy.Header"              = "Web Security Policy";
"UI.Settings.Section.WebSecurityLicense.Header"             = "Web Security License";

"UI.Settings.Cell.ConnectOnLaunch.Label"           = "Connect On Launch";
"UI.Settings.Cell.AutomaticReconnect.Label"        = "Automatic Reconnect";
"UI.Settings.Cell.URLControl.Label"                = "URL Control";
"UI.Settings.Cell.Bookmarks.Label"                 = "Bookmarks";
"UI.Settings.Cell.Bookmarks.Sortby"                = "Sort by";
"UI.Settings.Cell.Bookmarks.AccessTime"            = "Access Time";
"UI.Settings.Cell.Bookmarks.Name"                  = "Name";
"UI.Settings.Cell.Bookmarks.Section.BookmarkApps"          = "Bookmark Apps";
"UI.Settings.Cell.Bookmarks.Section.DisplaySettings"       = "Display Settings";
"UI.Settings.Cell.Bookmarks.App.NoSupport"                 = "No supported app installed";
"UI.Settings.Cell.Bookmarks.App.Install.Tips"              = "Tap to install or update";
"UI.Settings.Cell.Bookmarks.Web.Section"                   = "Web Apps";
"UI.Settings.Cell.Bookmarks.RDP.Section.Title"             = "Remote Desktop";
"UI.Settings.Cell.Bookmarks.RDP.Section"                   = "Remote Desktop Apps";
"UI.Settings.Cell.Bookmarks.RDP.DisplayName"               = "Remote Desktop (RDP)";
"UI.Settings.Cell.Bookmarks.VNC.Section"                   = "VNC Apps";
"UI.Settings.Cell.Bookmarks.SSH.Section"                   = "SSH Apps";
"UI.Settings.Cell.Bookmarks.Telnet.Section"                = "Telnet Apps";
"UI.Settings.Cell.Bookmarks.Citrix.Section"                = "Citrix Apps";
"UI.Settings.Cell.Bookmarks.External.Section"              = "External Apps";
"UI.Settings.Cell.Bookmarks.VMware.Section"                = "VMware Apps";
"UI.Settings.Cell.Files.Label"                             = "Files";
"UI.Settings.Cell.Files.Section.FileCache"                 = "File Cache";
"UI.Settings.Cell.Files.DeleteCachedFiles.Label"           = "Delete Cached Files";
"UI.Settings.Cell.Files.DeleteCachedFiles.value.format"    = "%lu file%@";
"UI.Settings.Cell.Files.NoFiles.Label"                     = "No files";
"UI.Settings.Cell.Files.DeleteCachedFiles.Warning"         = "Are you sure?";
"UI.Settings.Cell.Files.DeleteCachedFiles.Tips"            = "This will delete all downloaded files that have been cached on this device. This cannot be undone.";
"UI.Settings.Cell.Files.NoFilesFound.Label"                ="No files found";
"UI.Settings.Cell.Files.NoFilesFound.Delete.Warning"       = "There are no cached files to delete";
"UI.Settings.Cell.HTML5.Label"                     = "HTML5";
"UI.Settings.Cell.HTML5.Section.EnableHTML5"       = "Enable HTML5";
"UI.Settings.Cell.ImportedCert.Label"              = "Imported Certificate";
"UI.Settings.Cell.Logs.Label"                      = "Logs";
"UI.Settings.Cell.Logs.Section.LogSettings"        = "Log Settings";
"UI.Settings.Cell.Logs.Section.ImportedCertificateSettings" = " Imported Certificate Settings";
"UI.Settings.Cell.Logs.DebugLogging.LogSettings"   = "Debug Logging";
"UI.Settings.Cell.Logs.ClearLogs"                  = "Clear Logs";
"UI.Settings.Cell.Logs.ClearLogs.Warning"          = "Are you sure?";
"UI.Settings.Cell.Logs.ClearLogs.Tips"             = "This will delete all log files that have been saved on this device. This cannot be undone.";

"UI.Settings.Cell.Notifications.Label"             = "Notifications";
"UI.Settings.Cell.ClassicTheme.Label"              = "Classic Theme";
"UI.Settings.Section.Support.Header"               = "Support";
"UI.Settings.Cell.UserGuide.Label"                 = "User Guide";

"UI.Settings.Cell.DeviceInformation.Label"         = "Device Information";
"UI.Settings.Cell.DeviceInformation.Model.Label"         = "Model";
"UI.Settings.Cell.DeviceInformation.OS.Label"            = "OS";
"UI.Settings.Cell.DeviceInformation.Name.Label"          = "Name";
"UI.Settings.Cell.DeviceInformation.ID.Label"            = "ID";
"UI.Settings.Cell.DeviceInformation.WiFiNetwork.Header"         = "Wi-Fi Network";
"UI.Settings.Cell.DeviceInformation.CellularNetwork.Header"     = "Cellular Network";
"UI.Settings.Cell.DeviceInformation.BluetoothNetwork.Header"    = "Bluetooth Network";
"UI.Settings.Cell.DeviceInformation.DNSServer.Header"           = "DNS Servers";
"UI.Settings.Cell.DeviceInformation.NoWiFiNetwork.Label"         = "No Wi-Fi Connection";
"UI.Settings.Cell.DeviceInformation.NoCellularNetwork.Label"     = "No Cellular Connection";
"UI.Settings.Cell.DeviceInformation.NoBluetoothNetwork.Label"    = "No Bluetooth Connection";
"UI.Settings.Cell.DeviceInformation.NoDNSServer.Label"           = "No DNS Servers";
"UI.Settings.Cell.EmailLogs.Label"                               = "Email Logs";
"UI.Settings.Cell.EmailLogs.Subject"                             = "Logs from SonicWall Mobile Connect for iOS %@";
"UI.Settings.Cell.EmailLogs.Content.Format"                      = "SonicWall Mobile Connect for iOS %@\n Build: %@\n Model: %@\n OS: %@ %@\n Name: %@\n Device ID: %@";
"UI.Settings.Cell.ShareLogs.Label"                               = "Share Logs";

"UI.About.Version.foramt"                      = "Version %@";
"UI.About.VersionAndBuildNumber.foramt"        = "Version %@ Build %@";

"MSG_DOMAINS_ACCESS_DENIED"    = "Access denied - please contact your administrator";

"MSG_VALIDATION_ERROR_NAME_EXISTS"    = "A VPN configuration already exists with this name. Please choose a different name.";

"MSG_APPLIANCE_TYPE_ERROR_NOT_SNWL"   = "'%@' is either currently unreachable or is not a valid SonicWall appliance. Would you like to save this connection anyway?";

//"MSG_APPLIANCE_ERROR_NOT_AUTH_CREATE_VPN" = "SonicWall Mobile Connect is\nnot authorized to create\nVPN connections in iOS.";

//"MSG_APPLIANCE_ERROR_CREATE_VPN" = "There was an error granting NetExtender permission to create VPN connections.";

"MSG_FILESHARE_ERROR_FILE_NOT_FOUND" = "The file you requested could not be downloaded. It may have been moved or deleted.";
"MSG_FILESHARE_ERROR_NO_PERMISSION" = "You do not have permission to access the requested file or folder.";
"MSG_FILESHARE_ERROR_WRITE_FAILED" = "Failed to write temp file.";
"MSG_FILESHARE_ERROR_NO_APP"  = "App Not Available";
"MSG_FILESHARE_ERROR_NO_APP_TIPS"  = "No installed apps are able to launch this bookmark. Please contact your administrator.";

"MSG_WEB_ERROR_NO_APP"  = "App Not Available";
"MSG_WEB_ERROR_NO_APP_TIPS"  = "Safari is not installed.";

"MSG_LINKITEM_ERROR_NO_APP"  = "App Not Available";
"MSG_LINKITEM_ERROR_NO_APP_TIPS"  = "No installed apps are able to launch this bookmark. Please contact your administrator.";

"MSG_LINKITEM_ERROR_UNSUPPORTED"  = "Unsupported";
"MSG_LINKITEM_ERROR_UNSUPPORTED_TIPS"  = "This bookmark type cannot be launched by Mobile Connect (yet).";
"MSG_LINKITEM_ERROR_INVALID_CERTIFICATE_TIPS"  = "This bookmark cannot be launched because the server has an invalid or untrusted certificate.\n\nPlease ask your administrator to install a certificate from a trusted authority.";

"MSG_LINKITEM_REQUIRE_ONE_APPS_TIPS"  = "This bookmark requires one of the following apps to be installed or updated:";
"MSG_LINKITEM_REQUIRE_APPS_TIPS"  = "This bookmark requires the following app to be installed or updated:";

"AV_MSG_ERROR_NO_APP"  = "App Not Available";
"AV_MSG_ERROR_NO_APP_TIPS"  = "No installed apps are able to launch the url. Please contact your administrator.";

"AV_MSG_ERROR_ACCESS_DENIED"  = "Access Denied";
"AV_MSG_ERROR_ACCESS_DENIED_TIPS"  = "Access Denied. The required system capabilities are not present, enabled, or current.";

"AV_MSG_ERROR_TIMEOUT_WARNING"  = "Timeout warning";
"AV_MSG_ERROR_TIMEOUT_WARNING_TIPS"  = "Your session has been idle for %@ seconds and will be disconnected because of inactivity timeout";

"AV_MSG_ERROR_LICENSE_ERROR"  = "License error";
"AV_MSG_ERROR_LICENSE_ERROR_TIPS"  = "Could not connect because license count exceeded. Please try again later or contact your system administrator.";

"AV_MSG_ERROR_SERVER_DOWN"  = "Server Down";
"AV_MSG_ERROR_SERVER_DOWN_TIPS"  = "Please contact system administrator.";

"MSG_ERROR_CONNECTION_ERROR"  = "Connection Error";
"MSG_ERROR_CONNECTION_ERROR_INVALID_TIPS"  = "'%@' is not a SonicWall SSL VPN server.";
"MSG_ERROR_CONNECTION_ERROR_NOT_REACH_TIPS"  = "Could not reach server '%@'.";

"AV_MSG_ERROR_SYSTEM_ERROR"  = "System Error";
"AV_MSG_ERROR_SERVER_ERROR"  = "Server Error";
"AV_MSG_ERROR_LOGIN_ERROR"   = "Login Error";
"AV_MSG_ERROR_LOGIN_INVALID_CLIENT_IDENTITY_CERTIFICATE"  = "Access Denied. Invalid Client Identity Certificate.";
"AV_MSG_ERROR_LOGIN_DISCONNECTED_CREDENTIAL_EXPIRATION"  = "VPN disconnected due to credential expiration. Please re-authenticate.";
"AV_MSG_ERROR_LOGIN_SSL_HANDSHAKE_FAILURE"  = "Cannot authenticate. There are no matching client certificates present on your device. Please retry and select a different realm or contact your system administrator.";
"AV_MSG_ERROR_LOGIN_SSL_CERTIFICATE_NOT_SUPPORT"  = "The server’s SSL certificate is not supported on iOS 8 and below versions.";
"AV_MSG_ERROR_LOGIN_INVALID_REALM"  = "The realm is invalid.";
"AV_MSG_ERROR_LOGIN_NO_PS_CONNECTION"  = "Access Denied.";
"AV_MSG_ERROR_LOGIN_SSL_RENEGOTIATION_FAILED"  = "SSL Renegotiation failed.";
"AV_MSG_ERROR_LOGIN_NOT_ESTABLISH_CONNECTION_TIPS"  = "Could not establish secure connection with the VPN server. Please contact your system administrator";

"AV_MSG_ERROR_TIMEOUT"  = "Timeout";
"AV_MSG_ERROR_TIMEOUT_TIPS"  = "Your session has timed out. Please try again.";

"AV_MSG_ERROR_INACTIVITY_TIMEOUT"  = "Inactivity Timeout";
"AV_MSG_ERROR_INACTIVITY_TIMEOUT_TIPS"  = "Your session was terminated due to inactivity timeout.";

"MSG_ERROR_CERT_IDENTITY_NOT_VERIFY_FORMAT"  = "Mobile Connect can't verify the identity of \"%@\". Would you like to continue anyway?";
"MSG_ERROR_CERT_IDENTITY_NOT_VERIFY_TITLE" = "Cannot Verify Server Identity";

"MSG_USERNAME_ERROR_EMPTY"  = "Please enter your username and try again.";
"MSG_PASSWORD_ERROR_EMPTY"  = "Please enter your password and try again.";
"MSG_FIELD_ERROR_EMPTY"     = "Please fill in all fields and try again.";

"MSG_NEW_PASSWORD_ERROR_NOT_MATCH" = "New passwords do not match. Please try again.";

"MSG_PIN_ERROR_EMPTY"  = "Please enter a PIN and try again.";
"MSG_PIN_ERROR_NOT_MATCH" = "PINs do not match. Please try again.";
"MSG_CONNECTION_NAME_ERROR_EMPTY"  = "Please enter a name.";
"MSG_SERVER_ADDRESS_ERROR_EMPTY"   = "Please enter a server address.";

"MSG_LOGIN_FAILED_IP_POOL_NOT_CONFIG"            = "IP Pool is not configured";
"MSG_LOGIN_FAILED_IP_POOL_NOT_CONFIG_ADMIN"      = "IP pool is not configured. Please contact your administrator.";
"MSG_LOGIN_FAILED_UNHANDLED_RESPONSE"            = "Received unhandled response for request type %d";
"MSG_LOGIN_FAILED_PASSWORD_NEED_CHANGE"          = "Login failed - you must change your password.";
"MSG_LOGIN_FAILED_TWO_FACTOR_NOT_SUPPORT"        = "Two-factor login type %@ not yet implemented for iOS";
"MSG_LOGIN_FAILED_UNEXPECTED_RESPONSE"           = "Unexpected response: %@";
"MSG_LOGIN_FAILED_UNEXPECTED_PDA_RESPONSE"       = "Don't get proper PDA response";
"MSG_LOGIN_FAILED_CLIENT_CERTIFICATE_FAILED"       = "Client certificate authentication failed";
"MSG_LOGIN_FAILED_CLIENT_CERTIFICATE_FAILED_OR_TIMEOUT"       = "Client certificate authentication failed or timed out.\n\nTo avoid this error in the future, quickly choose 'Allow' or 'Always Allow' when prompted so that Mobile Connect will be able to access your client certificate.";
"MSG_LOGIN_FAILED_INTERNAL_ERROR"               = "An internal error occurred.";
"MSG_LOGIN_FAILED_TITLE"                        = "VPN Connection Failed.";

"MSG_SETTINGS_ERROR_NO_EMAIL_ACCOUNT"  = "No e-mail account";
"MSG_SETTINGS_ERROR_NO_EMAIL_TIPS"  = "Logs cannot be mailed because there are no e-mail accounts configured on this device. Please configure an e-mail account and try again.";

"MSG_CONNECTION_ERROR_DISCONNECT_TIME_OUT"  = "Mobile Connect has been disconnected due to inactivity.\n\n Tap 'Reconnect' to connect again.";

"MSG_CONNECTION_ERROR_DISCONNECT_GENERAL_REASON"  = "Mobile Connect has been disconnected for one of the following reasons:\n\n
* There was a break in the network connection.\n
* The connection was idle for longer than the configured idle timeout.\n
* Your user account was logged out of the SSL VPN portal.\n\n
Tap 'Reconnect' to connect again.";

"MSG_CONNECTION_ERROR_DISCONNECT_EPC_CHECK_FAILURE"  = "EPC check failed.\nPlease see log for details.";
"MSG_CONNECTION_ERROR_DISCONNECT_NO_ROUTES"  = "No routes found. Please contact your administrator.";
"MSG_CONNECTION_ERROR_DISCONNECT_NO_SUITABLE_PROTOCOL" = "No Suitable protocol.";

"MSG_CONNECTION_ERROR_CERTIFICATE_DISABLED"  = "A client certificate is required, but client certificates are disabled for this connection.";
"MSG_CONNECTION_ERROR_CERTIFICATE_NONE"  = "A client certificate is required, but none are available.";


"MSG_ERROR_ILLEGAL_URL"  = "Cannot launch incomplete/malformed URL: %@";
"MSG_ERROR_NO_SUPPORTED_APP"  = "Cannot launch URL: %@\n\nYou may need to install a supporting app.";

"MSG_PASSWORD_EXPIRE_TITLE"        = "Password Expiration";
"MSG_PASSWORD_CHANGE_SUCCESS"      = "Your password was changed successfully.";
"MSG_PASSWORD_EXPIRE_FORMAT"       = "Your password will expire in %d %@. %@";
"MSG_PASSWORD_EXPIRE_CHANGE_TIPS"  = "Would you like to change it now?";
"MSG_PASSWORD_EXPIRE_WARNING"      = "You should change it as soon as possible.";

"UI.Alert.WrongServerType.Title"   = "Configuration Error";
"UI.Alert.WrongServerType.Message" = "The server configuration has changed.  Please verify the connection settings and update them if necessary.";

"UI.Alert.UnknownError.Message"  = "Unknown error";

"UI.Alert.Disconnected.Title"   = "Disconnected";
"UI.Alert.TouchID.Title"   = "Touch ID";
"UI.Alert.TouchID.Message.Format"   = "Use %@ for login?";
"UI.Alert.TouchID.Reason.Format"    = "Logging in to VPN Server\n%@\n\n";

"UI.Alert.URLControlDisabled.Title"   = "URL Control Disabled";
"UI.Alert.URLControlDisabled.Message" = "The URL Control feature is disabled.  It can be enabled on the Settings tab.";

"UI.Alert.InstallOrUpdateRequired.Title"   = "Install or Update Required";
"UI.Alert.InstallOrUpdateRequired.Message" = "%@ is not installed, or needs an update. Would you like to download it from the App Store?\n\nThis app is not developed or supported by SonicWall. SonicWall is not responsible for any charges incurred by purchasing or using it.";

"UI.Alert.ServerPort.Title" = "Server Port";
"UI.Alert.ServerPort.Message.Format" = "Another port was detected on this server. Would you like to change the server to \"%@\"?\n\nIf you're not sure, say yes.";

"UI.Alert.LoginFailed.Title" = "Login Failed";
"UI.Alert.LoginFailed.InvalidSession.Message" = "Invalid Session";

"AV_UI.Alert.AuthenticationFailed.Title"   = "Authentication failed";
"AV_UI.Alert.AuthenticationFailed.Message" = "Login failed. Invalid Username or Password. Please try again.";

"UI.Alert.UserGuideUnavailable.Title"   = "User Guide Unavailable";
"UI.Alert.UserGuideUnavailable.Message" = "The Mobile Connect User Guide is unavailable at this time.  Please try again later.";

//"UI.Alert.SonicWALLMobileConnect.Title"        = "SonicWall Mobile Connect";
"UI.Alert.SonicWALLMobileConnect.Message"      = "Do you want to enable SonicWall Mobile Connect VPN functionality?";
//"UI.Alert.SonicWALLMobileConnect.Message.IPad" = "Do you want to extend the Virtual Private Network (VPN) capabilities of your device to support SonicWall VPN functionality?";

"UI.Alert.HostNameOrIPAddress.Title" = "Host name or IP Address";

"UI.Alert.UnexpectedError.Title" = "Unexpected Error";

"UI.Alert.UnsupportedFile.Title"   = "Unsupported file";
"UI.Alert.UnsupportedFile.Message" = "Mobile Connect does not support files with the extension \"%@\".\n\nYou can try downloading the file anyway, but it may not be viewable unless you have an appropriate app installed for viewing it.";

"UI.Alert.FileError.Title"         = "File Error";
"UI.Alert.FileError.Message"       = "An external app must be used to view this file, but external apps are not allowed by your administrator.";

"UI.Alert.Permission.Required.Title"         = "Important: VPN Permission Required";
"UI.Alert.Permission.Required.Message"       = "Mobile Connect must first be granted permission in order to save VPN configurations.\n\nPlease try again, and select “Allow” when prompted.";

"UI.Alert.Connection.Policy.Requirements.Message"       = "Cannot proceed with the VPN connection because this device does not meet your organization's policy requirements. Please contact your system administrator.";

"UI.Alert.Select.Realm.Message"       = "Please select a realm from the list or type a realm name";
"UI.Alert.Resizing.Window.Message"    = "Reconnection will happen while resizing the window. Are you sure to continue?";

"UI.Alert.URL.Control.Security.Title"         = "URL Control Security Alert";
"UI.Alert.URL.Control.Security.Message"       = "Enabling URL Control allows other apps to control Mobile Connect without confirmation.  This reduces the overall security of Mobile Connect.\n\nClick 'Enable URL Control' to proceed.";

"UI.Alert.URL.Control.Enable.Title" = "Enable URL Control";

"UI.Alert.Server.NotReachable.Title"       = "VPN Server Not Reachable";
"UI.Alert.Server.NotReachable.Message"     = "Unable to connect to the VPN server. Please check your network connectivity.";

"UI.Alert.Authentication.Required.Title"       = "Authentication Required";

"UI.Alert.Biometric.Enabled.Title"       = "%@ Enabled";
"UI.Alert.Biometric.Enabled.Message"     = "%@ is available for password authentication after the next successful login only if %@ is permitted by the VPN server policy.\n\nContact the VPN server administrator for more information.";

"UI.LearningMode.Not.Configure.Message"  = "Marked applications do not have any versions configured. To learn the application signature, launch the application and access a corporate network resource with it.";

"UI.LearningMode.Not.Approval.Message"  = "Marked applications have learned versions that require approval. To approve the version for general use, log in to AMC and Approve the pending version in the Client Application list.";

"UI.LearningMode.Fully.Configure.Message"  = "Marked applications are available for general use. If you need to learn a new version of an application, launch it and access a corporate network resource. If the application signature has not been seen before, the appliance will save a new version entry for the Client Application which you can then approve in AMC.";

"AV_MSG_APP_SELECTION_PERMIT_NOTICE" = "The following list of trusted apps are permitted to access the corporate network. All other apps that try to access the corporate network will be blocked. You can block trusted apps from sending data to the corporate network by unselecting them. You can continue to use all the apps on your device to access sites that are not on the corporate network.";

"VPN_CONNECTION_STATUS_DISCONNECTED"             = "Disconnected";
"VPN_CONNECTION_STATUS_DISCONNECTING"            = "Disconnecting...";
"VPN_CONNECTION_STATUS_CONNECTED"                = "Connected";
"VPN_CONNECTION_STATUS_CONNECTING"               = "Connecting...";
"VPN_CONNECTION_STATUS_RECONNECTING"             = "Reconnecting...";
"VPN_CONNECTION_STATUS_NO_CONNECTION_SELECTED"   = "No connection selected";
"VPN_CONNECTION_STATUS_INVALID_CONFIGURATION"    = "Invalid configuration";
"VPN_CONNECTION_STATUS_INACTIVE"                 = "Inactive";
"VPN_CONNECTION_STATUS_CONTACTING"               = "Contacting...";
"VPN_CONNECTION_STATUS_LOGGING_IN"               = "Logging in...";

"MCLINKITEM_CATEGORY_NAME_ALL"                 ="All";
"MCLINKITEM_CATEGORY_NAME_Desktop"             ="Desktop";
"MCLINKITEM_CATEGORY_NAME_FILE"                ="Files";
"MCLINKITEM_CATEGORY_NAME_Mobile"              ="Mobile";
"MCLINKITEM_CATEGORY_NAME_PERSONAL"            ="Personal";
"MCLINKITEM_CATEGORY_NAME_TERMINAL"            ="Terminal";
"MCLINKITEM_CATEGORY_NAME_WEB"                 ="Web";

"MC_STATEMENT_BEFORE_ACCEPT" = "Please notice that you can not use SonicWall Mobile Connect if you did not accept the statement.";
"MC_STATEMENT_TEXT"          = "Mobile Connect collects username and password information for authentication in order to establish a VPN connection. The app also checks device information including OS version, device name, device model and network information for VPN access policy compliance.  Mobile Connect does not upload any user data to SonicWall owned servers, and SonicWall does not collect any user information from our app. Instead SonicWall customers purchase and deploy SonicWall VPN products, and those hardware or virtual appliances are the servers where VPN authentication and policy compliance checks are performed. The authentication and compliance policies are defined by the administrators of each VPN server, not SonicWall.";
"MC_STATEMENT"               = "Statement";

"UI.Alert.PublicIP.Message" = "Public IP address is detected on WiFi interface, it may cause high risk of information leakage. Are you sure to continue?";
